read_verilog src/*.v

hierarchy -check -top top

write_json docs/diagrams/top.json

